'''
폴리오미노란 크기가 1×1인 정사각형을 여러 개 이어서 붙인 도형

정사각형은 서로 겹치면 안 된다.
도형은 모두 연결
정사각형의 변끼리 연결
꼭짓점과 꼭짓점만 맞닿아 있으면 안 된다.

정사각형 4개를 이어 붙인 폴리오미노는 테트로미노라고 하며, 다음과 같은 5가지

각각의 칸에는 정수가 하나 쓰여 있다.
테트로미노 하나를 적절히 놓아서 
테트로미노가 놓인 칸에 쓰여 있는 수들의 합을 최대로 하는 프로그램을 작성하시오.

'''
import sys
input = sys.stdin.readline

mapp= []
n, m = map(int, input().split())
for i in range(n):
    tmp = list(map(int, input().split()))
    mapp.append(tmp)


''' 회전이나 대칭을 시켜도 됨'''

'''
테트로미노 값 저장 
'''

# t1x = [1, 1, 1]
# t1y = [0, 0, 0]

# t1xd = [0, 0, 0]
# t1yd = [1, 1, 1]

# t2x = [1, 0, -1]
# t2y = [0, 1, 0]

# ''' 회전, 대칭 '''

# t3x = [1, 0, 1]
# t3y = [0, 1, -1]

# t3x1 = [0, -1, +1]
# t3y1 = [1, 0, 1]

# t3x2 = [0, 1, -1]
# t3y2 = [1, 0, 1]

# t3x3 = [1, 0, 1]
# t3y3 = [0, 1, -1]


# t4x = [0, 1, 0]
# t4y = [1, 0, 1]

# t4x1=[-1, 0, -1]
# t4y1=[0, 1, 0]

# t4x2=[0, -1, 0]
# t4x2=[1, 0, 1]

# t4x3=[1, 0, 1]
# t4y3=[0, 1, 0]

# t5x=[0,0,1]
# t5y=[1, 1, 0]

# t5x1=[0, 1, 1]
# t5y1=[1, -1, 0]

# t5x2=[1, 0, 0]
# t5y2=[0, 1, 1]

# t5x3=[0, -1, -1]
# t5y3=[1, 0, 0]

# t5x4=[0, 1, 1]
# t5y4=[1, 0, 0]

# t5x5=[1, -1, 0]
# t5y5=[0, 1, 1]

# t5x6=[1, 1, 0]
# t5y6=[0, 0, 1]

# t5x7=[0, 0, -1]
# t5y7=[1, 1, 0]



t3x = [[1, 0, 1], [0, 1, -1]], [[0, -1, +1], [1, 0, 1]], [[0, 1, -1], [1, 0, 1]], [[0, 1, 0], [1, 0, 1]], [[-1, 0, -1], [0, 1, 0]],[[0, -1, 0],[1, 0, 1]],[[1, 0, 1],[0, 1, 0]], [[1, 0, 1],[0, 1, -1]],[[1, 0, 1],[0, -1, 1]], [[0,0,1], [1, 1, 0]], [[0, 1, 1], [1, -1, 0]], [[1, 0, 0], [0, 1, 1]],[[0, -1, -1], [1, 0, 0]],[[0, 1, 1], [1, 0, 0]], [[1, -1, 0], [0, 1, 1]], [[1, 1, 0], [0, 0, 1]], [[0, 0, -1], [1, 1, 0]], [[1, 1, 1], [0, 0, 0]], [[0, 0, 0],[1, 1, 1]], [[1, 0, -1], [0, 1, 0]]

# print('hi', len(t3x))
result = 0
for i in range(n):
    for j in range(m):
        for indexx, value in enumerate(t3x):
            xx, yy = value
            
            summ = mapp[i][j]
            clear=0
            nx = j
            ny = i
            for index in range(3):
                ni = ny + yy[index]
                nj = nx + xx[index]

                # if i ==2 and j ==0 and indexx==16:
                #     print(ni, nj)

                if 0<=ni<n and 0<=nj<m:
                    summ+=mapp[ni][nj]
                    ny = ni
                    nx = nj
                else:
                    clear=1
                    break
            
            if clear ==0:
                if result< summ:
                    result=summ
                    # print('')
                    # print('indexx, xx,yy',indexx, xx, yy)
                    # print('i, j: ', i, j, summ, indexx,'-----------------------------------')
                    
print(result)
            

